In [1]:
import pandas as pd

##### DataFrame.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)[source]
Join columns of another DataFrame.

Join columns with other DataFrame either on index or on a key column. Efficiently join multiple DataFrame objects by index at once by passing a list.

In [2]:
df1=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [3]:
df2=pd.DataFrame({'C':[4,5,6],'D':[40,50,60]})
df2

   C   D
0  4  40
1  5  50
2  6  60

In [5]:
display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

### joining the 2 data frame

In [7]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [8]:
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

### if df have different index then they will not be joined

In [10]:
df1=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]},index=['a','b','c'])
df1

   A   B
a  1  10
b  2  20
c  3  30

In [11]:
df2

   C   D
0  4  40
1  5  50
2  6  60

####  here both df have different index , they will not join properly

In [12]:
df1.join(df2)

   A   B   C   D
a  1  10 NaN NaN
b  2  20 NaN NaN
c  3  30 NaN NaN

In [13]:
df2=pd.DataFrame({'C':[4,5,6],'D':[40,50,60]},index=['a','b','c'])
df2

   C   D
a  4  40
b  5  50
c  6  60

In [14]:
df1.join(df2)

   A   B  C   D
a  1  10  4  40
b  2  20  5  50
c  3  30  6  60

####  if df have different values then it will show NaN at those places

In [15]:
df1

   A   B
a  1  10
b  2  20
c  3  30

In [17]:
df2=pd.DataFrame({'C':[4,5],'D':[40,50]},index=['a','b',])
df2

   C   D
a  4  40
b  5  50

In [18]:
df1.join(df2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

#### we can use how parameter using inner/outer/left/right to handle this error

In [20]:
df1.join(df2,how='inner')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [21]:
df1.join(df2,how='outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [22]:
df1.join(df2,how='left')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [23]:
df1.join(df2,how='right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

#### if df have same column name, it will give error
we have to use lsuffix or rsuffix

In [29]:
df1

   A   B
a  1  10
b  2  20
c  3  30

In [30]:
df2=pd.DataFrame({'A':[4,5],'B':[40,50]},index=['a','b'])
df2

   A   B
a  4  40
b  5  50

In [35]:
# df1.join(df2) #this will give error
df1.join(df2,rsuffix='_l') #it will change the name of heading of passed suffix

   A   B  A_l   B_l
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [34]:
# df1.join(df2) #this will give error
df1.join(df2,lsuffix='_r')

   A_r  B_r    A     B
a    1   10  4.0  40.0
b    2   20  5.0  50.0
c    3   30  NaN   NaN